{
  "_name_or_path": "9G4B-v",
  "version": 3.0,
  "architectures": [
    "FM9GV"
  ],
  "auto_map": {
    "AutoConfig": "configuration_fm9g.FM9GVConfig",
    "AutoModel": "modeling_fm9gv.FM9GV",
    "AutoModelForCausalLM": "modeling_fm9gv.FM9GV"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "dim_model_base": 256,
  "eos_token_id": 2,
  "head_dim": 96,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.1,
  "intermediate_size": 6400,
  "kv_lora_rank": 256,
  "max_position_embeddings": 32768,
  "num_attention_heads": 40,
  "num_hidden_layers": 62,
  "num_key_value_heads": 40,
  "pretraining_tp": 1,
  "q_lora_rank": 768,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 32,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "long_factor": [
      1.0591234137867171,
      1.1241891283591912,
      1.2596935748670968,
      1.5380380402321725,
      2.093982484148734,
      3.1446935121267696,
      4.937952647693647,
      7.524541999994549,
      10.475458000005451,
      13.062047352306353,
      14.85530648787323,
      15.906017515851266,
      16.461961959767827,
      16.740306425132907,
      16.87581087164081,
      16.940876586213285
    ],
    "original_max_position_embeddings": 32768,
    "short_factor": [
      1.0591234137867171,
      1.1241891283591912,
      1.2596935748670968,
      1.5380380402321725,
      2.093982484148734,
      3.1446935121267696,
      4.937952647693647,
      7.524541999994549,
      10.475458000005451,
      13.062047352306353,
      14.85530648787323,
      15.906017515851266,
      16.461961959767827,
      16.740306425132907,
      16.87581087164081,
      16.940876586213285
    ],
    "type": "longrope"
  },
  "rope_theta": 10000.0,
  "scale_depth": 1.4,
  "scale_emb": 12,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.2",
  "use_cache": true,
  "v_head_dim": 64,
  "vocab_size": 73448,
  "batch_vision_input": true,
  "drop_vision_last_layer": false,
  "image_size": 448,
  "model_type": "fm9gv",
  "patch_size": 14,
  "query_num": 64,
  "slice_config": {
    "max_slice_nums": 9,
    "patch_size": 14,
    "model_type": "fm9gv"
  },
  "slice_mode": true,
  "vision_config": {
    "hidden_size": 1152,
    "image_size": 980,
    "intermediate_size": 4304,
    "model_type": "siglip",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "patch_size": 14
  }
}
